# SQL (in Python)

Powerpoint แนะนำ Database อยู่ใน mycourseville

เพื่อความง่าย แบบฝึกหัดนี้เราจะใช้ SQL ที่มีเป็น Library ใน Python อยู่แล้วในการเรียนคำสั่ง SQL แต่เวลาทำงานจริงเรามักจะลง software database ในเครื่องแล้วเขียน Python เชื่อมต่อ database ตัวนั้น ๆ (เช่น PostgreSQL จะใช้ library psycopg2 เป็นตัวเชื่อมต่อ)

ให้ copy code ต่อไปนี้เพื่อรันใน colab ของตัวเองหรือใน Jupyter Notebook ของตัวเอง

เป็นการสร้างตาราง 2 ตาราง จากตัวอย่างในเว็บ https://en.wikibooks.org/wiki/SQL_Exercises/The_computer_store

ถ้าใช้ jupyter notebook ในเครื่องตัวเอง ให้ลง sqlite3 ใน environment ของตัวเองก่อนด้วยคำสั่ง conda install -c blaze sqlite3

## 1.   สร้าง Database

In [ ]:
# CREATING THE TABLE
import sqlite3

conn = sqlite3.connect('sqltest.db')
print("Opened database successfully");

conn.execute('''
CREATE TABLE IF NOT EXISTS Manufacturers (
	Code INTEGER PRIMARY KEY NOT NULL,
	Name CHAR(50) NOT NULL 
);''')

conn.commit()
conn.execute('''
CREATE TABLE Products (
	Code INTEGER PRIMARY KEY NOT NULL,
	Name CHAR(50) NOT NULL ,
	Price REAL NOT NULL ,
	Manufacturer INTEGER NOT NULL 
		CONSTRAINT fk_Manufacturers_Code REFERENCES Manufacturers(Code));''')

conn.commit()

print("Table created successfully");

Opened database successfully
Table created successfully

keyword ที่ควรทราบ
* PRIMARY KEY คือ คอลัมน์นั้นห้ามซ้ำ
* NOT NULL คือ ห้ามว่าง
* CONSTRAINT foreign_key_name REFERENCES main_table(key_column) คือสร้าง foreign key โยงสองตารางเข้าด้วยกัน ซึ่งในที่นี้คือให้คอลัมน์ Manufacturer โยงกับ code ในตาราง Manufacturer ผลในการกำหนด foreign key คือ จะไม่อนุญาตให้ทำการเพิ่ม code อื่น ๆ ที่ไม่ได้อยู่ในตาราง Manufacturer
* commit คือการยืนยันคำสั่งก่อนหน้า เราจะสามารถ roll back กลับไปจุด commit ล่าสุดได้ ใช้กับคำสั่ง SQL ประเภท DML

In [ ]:
# INSERT VALUES
conn.execute("INSERT INTO Manufacturers(Code,Name) VALUES(1,'Sony');")
conn.execute("INSERT INTO Manufacturers(Code,Name) VALUES(2,'Creative Labs');")
conn.execute("INSERT INTO Manufacturers(Code,Name) VALUES(3,'Hewlett-Packard');")
conn.execute("INSERT INTO Manufacturers(Code,Name) VALUES(4,'Iomega');")
conn.execute("INSERT INTO Manufacturers(Code,Name) VALUES(5,'Fujitsu');")
conn.execute("INSERT INTO Manufacturers(Code,Name) VALUES(6,'Winchester');")

conn.execute("INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(1,'Hard drive',240,5);")
conn.execute("INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(2,'Memory',120,6);")
conn.execute("INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(3,'ZIP drive',150,4);")
conn.execute("INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(4,'Floppy disk',5,6);")
conn.execute("INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(5,'Monitor',240,1);")
conn.execute("INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(6,'DVD drive',180,2);")
conn.execute("INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(7,'CD drive',90,2);")
conn.execute("INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(8,'Printer',270,3);")
conn.execute("INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(9,'Toner cartridge',66,3);")
conn.execute("INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(10,'DVD burner',180,2);")

## 2.   ทดลอง query

เลือกทุกแถวทุกคอลัมน์มาจากตาราง

เราสามารถเลือกทุกคอลัมน์ได้โดยใช้เครื่องหมาย *

In [ ]:
for row in conn.execute("SELECT * FROM manufacturers"):
  print(row)

(1, 'Sony')
(2, 'Creative Labs')
(3, 'Hewlett-Packard')
(4, 'Iomega')
(5, 'Fujitsu')
(6, 'Winchester')

In [ ]:
for row in conn.execute("select * from Products"):
  print(row)

(1, 'Hard drive', 240.0, 5)
(2, 'Memory', 120.0, 6)
(3, 'ZIP drive', 150.0, 4)
(4, 'Floppy disk', 5.0, 6)
(5, 'Monitor', 240.0, 1)
(6, 'DVD drive', 180.0, 2)
(7, 'CD drive', 90.0, 2)
(8, 'Printer', 270.0, 3)
(9, 'Toner cartridge', 66.0, 3)
(10, 'DVD burner', 180.0, 2)

หรือจะใช้คำสั่ง fetchall() ก็ได้

In [ ]:
conn.execute("SELECT * FROM Products").fetchall()

[(1, 'Hard drive', 240.0, 5),
 (2, 'Memory', 120.0, 6),
 (3, 'ZIP drive', 150.0, 4),
 (4, 'Floppy disk', 5.0, 6),
 (5, 'Monitor', 240.0, 1),
 (6, 'DVD drive', 180.0, 2),
 (7, 'CD drive', 90.0, 2),
 (8, 'Printer', 270.0, 3),
 (9, 'Toner cartridge', 66.0, 3),
 (10, 'DVD burner', 180.0, 2)]

เลือกแค่บางคอลัมน์

In [ ]:
conn.execute("select name,price from products").fetchall()

[('Hard drive', 240.0),
 ('Memory', 120.0),
 ('ZIP drive', 150.0),
 ('Floppy disk', 5.0),
 ('Monitor', 240.0),
 ('DVD drive', 180.0),
 ('CD drive', 90.0),
 ('Printer', 270.0),
 ('Toner cartridge', 66.0),
 ('DVD burner', 180.0)]

ใส่เงื่อนไขเลือกแถว ใช้คำสั่ง where

In [ ]:
conn.execute("select name,price from products where name='Hard drive'").fetchall()

[('Hard drive', 240.0)]

In [ ]:
conn.execute("select * from products where name like 'Z%'").fetchall()

[(3, 'ZIP drive', 150.0, 4)]

In [ ]:
conn.execute("select name,price from products where name like '_I%'").fetchall()

[('ZIP drive', 150.0)]

In [ ]:
conn.execute("select name,price from products where name is NULL").fetchall()

[]

เลือกสองตารางมาเชื่อมกัน

In [ ]:
conn.execute("select * from products").fetchall()

[(1, 'Hard drive', 240.0, 5),
 (2, 'Memory', 120.0, 6),
 (3, 'ZIP drive', 150.0, 4),
 (4, 'Floppy disk', 5.0, 6),
 (5, 'Monitor', 240.0, 1),
 (6, 'DVD drive', 180.0, 2),
 (7, 'CD drive', 90.0, 2),
 (8, 'Printer', 270.0, 3),
 (9, 'Toner cartridge', 66.0, 3),
 (10, 'DVD burner', 180.0, 2)]

In [ ]:
conn.execute("select * from manufacturers").fetchall()

[(1, 'Sony'),
 (2, 'Creative Labs'),
 (3, 'Hewlett-Packard'),
 (4, 'Iomega'),
 (5, 'Fujitsu'),
 (6, 'Winchester')]

In [ ]:
conn.execute("select p.name,p.price,p.manufacturer,m.name from products p, manufacturers m where p.manufacturer=m.code").fetchall()

[('Hard drive', 240.0, 5, 'Fujitsu'),
 ('Memory', 120.0, 6, 'Winchester'),
 ('ZIP drive', 150.0, 4, 'Iomega'),
 ('Floppy disk', 5.0, 6, 'Winchester'),
 ('Monitor', 240.0, 1, 'Sony'),
 ('DVD drive', 180.0, 2, 'Creative Labs'),
 ('CD drive', 90.0, 2, 'Creative Labs'),
 ('Printer', 270.0, 3, 'Hewlett-Packard'),
 ('Toner cartridge', 66.0, 3, 'Hewlett-Packard'),
 ('DVD burner', 180.0, 2, 'Creative Labs')]

ดูชื่อ column

In [ ]:
for row in conn.execute("PRAGMA table_info(Products)"):
  print(row)

(0, 'Code', 'INTEGER', 1, None, 1)
(1, 'Name', 'CHAR(50)', 1, None, 0)
(2, 'Price', 'REAL', 1, None, 0)
(3, 'Manufacturer', 'INTEGER', 1, None, 0)

In [ ]:
for row in conn.execute("PRAGMA table_info(Manufacturers)"):
  print(row)

(0, 'Code', 'INTEGER', 1, None, 1)
(1, 'Name', 'CHAR(50)', 1, None, 0)

เราสามารถสร้างตัวแปรขึ้นมา แล้วนำไปใส่ในคำสั่ง SQL ได้ ตามตัวอย่าง
การสร้างเป็นตัวแปรทำให้เราทำให้เราสามารถสร้างระบบ interactive ได้

In [ ]:
n=('ZIP drive',)
for row in conn.execute("select * from Products where Name=?",n):
  print(row)

(3, 'ZIP drive', 150.0, 4)

In [ ]:
type(n)

tuple

ถ้าเราจะมีหลาย ๆ ตัวแปร ก็ต้องใช้คำสั่ง executemany

In [ ]:
manus = [(7, 'Sandisk'),
         (8, 'Kingston')]
conn.executemany('INSERT INTO Manufacturers VALUES (?,?)', manus)

In [ ]:
conn.execute("UPDATE Manufacturers SET name='KKKK' where code=8")

In [ ]:
conn.execute("DELETE FROM Manufacturers WHERE code=8")

In [ ]:
conn.execute("select * from Manufacturers").fetchall()

[(1, 'Sony'),
 (2, 'Creative Labs'),
 (3, 'Hewlett-Packard'),
 (4, 'Iomega'),
 (5, 'Fujitsu'),
 (6, 'Winchester'),
 (7, 'Sandisk')]

In [ ]:
type(manus)

list

## 3. การใช้งานกับ pandas

นำข้อมูลที่ได้จากการ query ไปใส่ไว้ใน dataframe ของ pandas

In [ ]:
import pandas as pd

In [ ]:
df = pd.read_sql_query("SELECT * from Products", conn)

เอาผลใส่ใน dataframe ทำให้พิมพ์ออกมาสวยกว่า

In [ ]:
df

   Code             Name  Price  Manufacturer
0     1       Hard drive  240.0             5
1     2           Memory  120.0             6
2     3        ZIP drive  150.0             4
3     4      Floppy disk    5.0             6
4     5          Monitor  240.0             1
5     6        DVD drive  180.0             2
6     7         CD drive   90.0             2
7     8          Printer  270.0             3
8     9  Toner cartridge   66.0             3
9    10       DVD burner  180.0             2

อ่านเพิ่มที่นี่
https://datacarpentry.org/python-ecology-lesson/09-working-with-sql/index.html

ถ้าจะทำย้อนกลับคือ เอาข้อมูลใน dataframe ไปใส่ใน SQLite ก็ให้ทำตามนี้

In [ ]:
#ตัวอย่างจาก https://datatofish.com/create-pandas-dataframe/
cars = {'Brand': ['Honda Civic','Toyota Corolla','Ford Focus','Audi A4'],
        'Price': [22000,25000,27000,35000]
        }

df = pd.DataFrame(cars, columns = ['Brand', 'Price'])

In [ ]:
df.to_sql('cars', con=conn, if_exists='append')

In [ ]:
conn.execute("select * from cars").fetchall()

[(0, 'Honda Civic', 22000),
 (1, 'Toyota Corolla', 25000),
 (2, 'Ford Focus', 27000),
 (3, 'Audi A4', 35000)]

## 4. ประเภทของคำสั่ง SQL

*   DDL(Data Definition Language) คำสั่งจัดการโครงสร้างตาราง เช่น เพิ่ม/ลด คอลัมน์ เปลี่ยนชื่อตาราง
*   DQL (Data Query Language) คำสั่ง select
*   DML(Data Manipulation Language) คำสั่งเพิ่ม ลด แก้ไข ข้อมูลในตาราง
*   DCL(Data Control Language) คำสั่งให้สิทธิ์หรือถอนสิทธิผู้ใช้งาน
*   TCL(transaction Control Language) คำสังจัดการ transaction เช่นการ commit/rollback

https://www.geeksforgeeks.org/sql-ddl-dql-dml-dcl-tcl-commands/

# SQL Practice 20 question

In [ ]:
conn.execute("select name from products").fetchall()

[('Hard drive',),
 ('Memory',),
 ('ZIP drive',),
 ('Floppy disk',),
 ('Monitor',),
 ('DVD drive',),
 ('CD drive',),
 ('Printer',),
 ('Toner cartridge',),
 ('DVD burner',)]

In [ ]:
conn.execute("select name, price from products").fetchall()

[('Hard drive', 240.0),
 ('Memory', 120.0),
 ('ZIP drive', 150.0),
 ('Floppy disk', 5.0),
 ('Monitor', 240.0),
 ('DVD drive', 180.0),
 ('CD drive', 90.0),
 ('Printer', 270.0),
 ('Toner cartridge', 66.0),
 ('DVD burner', 180.0)]

In [ ]:
conn.execute("select name from products where price <= 200").fetchall()

[('Memory',),
 ('ZIP drive',),
 ('Floppy disk',),
 ('DVD drive',),
 ('CD drive',),
 ('Toner cartridge',),
 ('DVD burner',)]

In [ ]:
conn.execute("select name from products where price between 60 and 120").fetchall()

[('Memory',), ('CD drive',), ('Toner cartridge',)]

In [ ]:
pd.read_sql_query("SELECT avg(price) from Products", conn)

   avg(price)
0       154.1

In [ ]:
pd.read_sql_query("SELECT avg(price) from Products where manufacturer = 2", conn)

   avg(price)
0       150.0

In [ ]:
pd.read_sql_query("SELECT count(*) from Products where price>= 180", conn)

   count(*)
0         5

In [ ]:
pd.read_sql_query("SELECT name , price from Products where price >= 180 order by price DESC, name ASC", conn)

         Name  Price
0     Printer  270.0
1  Hard drive  240.0
2     Monitor  240.0
3  DVD burner  180.0
4   DVD drive  180.0

In [ ]:
pd.read_sql_query("SELECT p.code as product_code, p.name as product_name, p.price as product_price,p.Manufacturer as product_Manufacturer, m.code as Manufacturer_code, m.name as Manufacturer from Products p join manufacturers m on p.Manufacturer = m.code", conn)

   product_code     product_name  ...  Manufacturer_code     Manufacturer
0             1       Hard drive  ...                  5          Fujitsu
1             2           Memory  ...                  6       Winchester
2             3        ZIP drive  ...                  4           Iomega
3             4      Floppy disk  ...                  6       Winchester
4             5          Monitor  ...                  1             Sony
5             6        DVD drive  ...                  2    Creative Labs
6             7         CD drive  ...                  2    Creative Labs
7             8          Printer  ...                  3  Hewlett-Packard
8             9  Toner cartridge  ...                  3  Hewlett-Packard
9            10       DVD burner  ...                  2    Creative Labs

[10 rows x 6 columns]

In [ ]:
pd.read_sql_query("SELECT  p.name as product_name, p.price as product_price, m.name as Manufacturer from Products p join manufacturers m on p.Manufacturer = m.code", conn)

      product_name  product_price     Manufacturer
0       Hard drive          240.0          Fujitsu
1           Memory          120.0       Winchester
2        ZIP drive          150.0           Iomega
3      Floppy disk            5.0       Winchester
4          Monitor          240.0             Sony
5        DVD drive          180.0    Creative Labs
6         CD drive           90.0    Creative Labs
7          Printer          270.0  Hewlett-Packard
8  Toner cartridge           66.0  Hewlett-Packard
9       DVD burner          180.0    Creative Labs

In [ ]:
pd.read_sql_query("SELECT avg(p.price), m.code as Manufacturer_code from Products p join manufacturers m on p.Manufacturer = m.code group by m.code", conn)

   avg(p.price)  Manufacturer_code
0         240.0                  1
1         150.0                  2
2         168.0                  3
3         150.0                  4
4         240.0                  5
5          62.5                  6

In [ ]:
pd.read_sql_query("SELECT avg(p.price), m.name as Manufacturer_name from Products p join manufacturers m on p.Manufacturer = m.code group by m.name", conn)

   avg(p.price) Manufacturer_name
0         150.0     Creative Labs
1         240.0           Fujitsu
2         168.0   Hewlett-Packard
3         150.0            Iomega
4         240.0              Sony
5          62.5        Winchester

In [ ]:
pd.read_sql_query("SELECT m.name as Manufacturer_name from Products p join manufacturers m on p.Manufacturer = m.code group by m.name having avg(price) >=  150", conn)

  Manufacturer_name
0     Creative Labs
1           Fujitsu
2   Hewlett-Packard
3            Iomega
4              Sony

In [ ]:
pd.read_sql_query("SELECT name , price from Products order by price ASC limit 1", conn)

          Name  Price
0  Floppy disk    5.0

In [ ]:
pd.read_sql_query("SELECT m.name as manu_name, p.name as product_name,p.price from Products p join manufacturers m on p.Manufacturer = m.code group by m.name having p.price = max(p.price)", conn)

         manu_name product_name  Price
0    Creative Labs    DVD drive  180.0
1          Fujitsu   Hard drive  240.0
2  Hewlett-Packard      Printer  270.0
3           Iomega    ZIP drive  150.0
4             Sony      Monitor  240.0
5       Winchester       Memory  120.0

In [ ]:
conn.execute("INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(11,'Loudspeakers',70,2);")

In [ ]:
conn.execute("update products set name = 'Laser Printer' where code = 8")

In [ ]:
pd.read_sql_query("select name,code, price*90/100, manufacturer from products", conn)

               Name  Code  price*90/100  Manufacturer
0        Hard drive     1         216.0             5
1            Memory     2         108.0             6
2         ZIP drive     3         135.0             4
3       Floppy disk     4           4.5             6
4           Monitor     5         216.0             1
5         DVD drive     6         162.0             2
6          CD drive     7          81.0             2
7     Laser Printer     8         243.0             3
8   Toner cartridge     9          59.4             3
9        DVD burner    10         162.0             2
10     Loudspeakers    11          63.0             2

In [ ]:
pd.read_sql_query("select name,code, price*90/100, manufacturer from products where price>= 120", conn)

            Name  Code  price*90/100  Manufacturer
0     Hard drive     1         216.0             5
1         Memory     2         108.0             6
2      ZIP drive     3         135.0             4
3        Monitor     5         216.0             1
4      DVD drive     6         162.0             2
5  Laser Printer     8         243.0             3
6     DVD burner    10         162.0             2